// Сводная статистика и настройки отображения данных.
var statsData = {
  "top_soslovie": [
    [
      "Мастеровые",
      1139
    ],
    [
      "Мещане",
      501
    ],
    [
      "Солдаты",
      267
    ],
    [
      "Купцы",
      122
    ],
    [
      "Непременные работники",
      121
    ],
    [
      "Дворяне",
      97
    ],
    [
      "Канцелярские служители",
      77
    ],
    [
      "Младшие офицеры",
      47
    ],
    [
      "Крестьяне",
      44
    ],
    [
      "Горнозаводские служители",
      32
    ]
  ],
  "avg_areas": [
    [
      "Именитые граждане",
      1199
    ],
    [
      "Купцы",
      605
    ],
    [
      "Дворяне",
      506
    ],
    [
      "Нет данных",
      423
    ],
    [
      "Мещане",
      373
    ],
    [
      "Медицинские работники",
      276
    ],
    [
      "Старшие офицеры",
      274
    ],
    [
      "Непременные работники",
      260
    ],
    [
      "Горнозаводские служители",
      253
    ],
    [
      "Священнослужители",
      217
    ]
  ],
  "max_area": {
    "area": 20787,
    "surname": "Щепетильников",
    "num": "963",
    "settlement": "Екатеринбург",
    "street": "Уктусская улица"
  },
  "min_area": {
    "area": 6,
    "surname": "Волохитин",
    "num": "314",
    "settlement": "Екатеринбург",
    "street": "Улица Береговая подле пруда"
  },
  "top_surname": [
    "Пономарев",
    23
  ],
  "streets_count": 39,
  "total": 2569
};

var COLORS = {
  "Екатеринбург": "#C49A5C",
  "Нижне-Исетск": "#7A9AB0",
  "Уктус": "#9A7AB0"
};

var FILTERS = [
  {
    "key": "settlement",
    "title": "Поселение"
  },
  {
    "key": "soslovie",
    "title": "Сословие",
    "limit": 5
  },
  {
    "key": "sex",
    "title": "Пол",
    "inline": true
  },
  {
    "key": "buildingType",
    "title": "Тип постройки",
    "limit": 4
  },
  {
    "key": "familyStatus",
    "title": "Сем. положение",
    "inline": true,
    "limit": 3
  },
  {
    "key": "serviceType",
    "title": "Род службы",
    "inline": true
  },
  {
    "key": "registrationPlace",
    "title": "Место приписки",
    "limit": 5
  },
  {
    "key": "servicePlace",
    "title": "Место службы",
    "limit": 5
  }
];
